{
  "movies": [
    {
      "id": 1,
      "title": "Живая сталь",
      "year": 2011,
      "posterServe": "http://localhost:3001/posters/zhivaya-stal.png",
      "poster": "zhivaya-stal.png",
      "genres": ["фантастика", "семейный", "боевик"],
      "rating": 7.8,
      "description": "События фильма происходят в будущем, где бокс запрещен за негуманностью и заменен боями 2000-фунтовых роботов, управляемых людьми. Бывший боксер, а теперь промоутер, переметнувшийся в Робобокс, решает, что наконец нашел своего чемпиона, когда ему попадается выбракованный, но очень способный робот. Одновременно на жизненном пути героя возникает 11-летний парень, оказывающийся его сыном. И по мере того, как машина пробивает свой путь к вершине, обретшие друг друга отец и сын учатся дружить."
    },
    {
      "id": 2,
      "title": "Истребитель демонов: Бесконечная крепость",
      "year": 2025 ,
      "posterServe": "http://localhost:3001/posters/fighter.png",
      "poster": "fighter.png",
      "genres": ["аниме", "мультфильм", "фэнтези", "боевик"],
      "rating": 8.5,
      "description": "Демоны убили всех родных Тандзиро Камадо и обратили его младшую сестру Нэдзуко в демона. Парень вступил в Корпус истребителей демонов. Пока бойцы тренируются и готовятся к схватке с демонами, в поместье главы Корпуса появляется Мудзан Кибуцудзи — прародитель всех демонов и убийца семьи Тандзиро. Истребители спешат лидеру на помощь, но Мудзан переносит их в крепость демонов под названием Замок бесконечности."
    },
    {
      "id": 3,
      "title": "Зверополис 2",
      "year": 2025,
      "genres": ["семейный", "приключения", "детектив", "мультфильм",
        "боевик", "комедия", "преступление"],
      "description": "Кролик-полицейский Джуди и лис Ник идут по следу загадочной рептилии, чьё прибытие в Зверополис переворачивает жизнь города с ног на голову. Чтобы раскрыть дело, Джуди и Ник вынуждены работать под прикрытием в разных районах города.",
      "rating": 8.8,
      "posterServe": "http://localhost:3001/posters/zveropolis.png",
      "poster": "zveropolis.png"
    },
    {
      "id": 4,
      "title": "Переводчик",
      "year": 2018 ,
      "genres": [
        "Боевик",
        "Фантастика"
      ],
      "description": "Афганистан, март 2018 года. Во время спецоперации по поиску оружия талибов отряд сержанта армии США Джона Кинли попадает в засаду. В живых остаются только сам Джон, получивший ранение, и местный переводчик Ахмед, который сотрудничает с американцами. Очнувшись на родине, Кинли не помнит, как ему удалось выжить, но понимает, что именно Ахмед спас ему жизнь, протащив на себе через опасную территорию. Теперь чувство вины не даёт Джону покоя, и он решает вернуться за Ахмедом и его семьёй, которых в Афганистане усиленно ищут талибы.",
      "rating": 7.8,
      "posterServe": "http://localhost:3001/posters/perevod.png",
      "poster": "perevod.png"
    },
    {
      "id": 5,
      "title": "Форсаж ",
      "year": 2001,
      "genres": ["Боевик", "триллер", "криминал"],
      "description": "Его зовут Брайан, и он — фанат турбин и нитроускорителей. Он пытается попасть в автобанду легендарного Доминика Торетто, чемпиона опасных и незаконных уличных гонок. Брайан также полицейский, и его задание — втереться в доверие к Торетто, подозреваемому в причастности к дерзким грабежам грузовиков, совершаемым прямо на ходу.",
      "rating": 8.8,
      "posterServe": "http://localhost:3001/posters/forsazh.png",
      "poster": "forsazh.png"
    },
    {
      "id": 6,
      "title": "Интерстеллар",
      "year": 2014,
      "genres": ["Драма", "приключения", "Фантастика"],
      "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, коллектив исследователей и учёных отправляется сквозь червоточину (которая предположительно соединяет области пространства-времени через большое расстояние) в путешествие, чтобы превзойти прежние ограничения для космических путешествий человека и найти планету с подходящими для человечества условиями.",
      "rating": 8.7,
      "posterServe": "http://localhost:3001/posters/interstellar.png",
      "poster": "interstellar.png"
    },
    {
      "id": 7,
      "title": "Тёмный рыцарь",
      "year": 2008,
      "genres": ["фантастика", "боевик", "триллер", "криминал", "драма"],
      "description": "Бэтмен поднимает ставки в войне с криминалом. С помощью лейтенанта Джима Гордона и прокурора Харви Дента он намерен очистить улицы Готэма от преступности. Сотрудничество оказывается эффективным, но скоро они обнаружат себя посреди хаоса, развязанного восходящим криминальным гением, известным напуганным горожанам под именем Джокер.",
      "rating": 9.0,
      "posterServe": "http://localhost:3001/posters/dark.png",
      "poster": "dark.png"
    },
    {
      "id": 8,
      "title": "Мементо",
      "year": 2000,
      "genres": ["Драма", "триллер", "детектив", "криминал"],
      "description": "Леонард Шелби изысканно и дорого одет, ездит на новеньком «Ягуаре», но останавливается в дешевых мотелях. Он всеми силами пытается найти убийцу жены. Его проблема — редкая форма амнезии, потеря короткой памяти — помня все до убийства, он не помнит, что было 15 минут назад.",
      "rating": 7.9,
      "posterServe": "http://localhost:3001/posters/memento.png",
      "poster": "memento.png"
    },
    {
      "id": 9,
      "title": "Аватар",
      "year": 2009,
      "genres": [
        "Фантастика",
        "Боевик",
        "Драма",
        "приключения"
      ],
      "description": "Бывший морпех Джейк Салли прикован к инвалидному креслу. Несмотря на немощное тело, Джейк в душе по-прежнему остается воином. Он получает задание совершить путешествие в несколько световых лет к базе землян на планете Пандора, где корпорации добывают редкий минерал, имеющий огромное значение для выхода Земли из энергетического кризиса.",
      "rating": 8.0,
      "posterServe": "http://localhost:3001/posters/avatar.png",
      "poster": "avatar.png"
    },
    {
      "id": 10,
      "title": "Марсианин",
      "year": 2015,
      "genres": [
        "фантастика",
        "драма",
        "комедия",
        "приключения"
      ],
      "description": "Марсианская миссия «Арес-3» в процессе работы вынуждена экстренно покинуть планету из-за быстро надвигающейся песчаной бури. В попытке добраться до корабля во время бури инженер и биолог Марк Уотни получает повреждение скафандра обломками антенны и команда теряет его из виду. Посчитав его погибшим, экипаж улетает с Марса. Очнувшись, Уотни обнаруживает, что связь с Землёй отсутствует, но при этом полностью функционирует жилой модуль. Он начинает искать способы продержаться на имеющихся запасах еды, витаминов, воды и воздуха ещё 4 года до прилёта следующей миссии «Арес-4».",
      "rating": 8.8,
      "posterServe": "http://localhost:3001/posters/marte.png",
      "poster": "marte.png"
    },
    {
      "id": 11,
      "title": "Джон Уик 4",
      "year": 2023,
      "genres": [
        "Боевик",
        "триллер",
        "преступление"
      ],
      "description": "Оставляя за собой горы трупов, Джон Уик продолжает скрываться от всевозможных наёмных убийц, и теперь охоту на него возглавляет молодой и честолюбивый член Правления по имени Маркиз. Два управляющих отелями «Континенталь» в Нью-Йорке и Осаке, решившие по старой дружбе помочь своенравному киллеру, уже жестоко за это поплатились, но внезапно Джон узнаёт способ выбраться из этой, казалось бы, безвыходной ситуации.",
      "rating": 7.6,
      "posterServe": "http://localhost:3001/posters/johnwick.png",
      "poster": "johnwick.png"
    },
    {
      "id": 12,
      "title": "(Не)искусственный интеллект",
      "year": 2025,
      "genres": ["фантастика", "комедия", "приключения", "семейный"],
      "description": "Во время экскурсии в научно-исследовательском центре 17-летний студент- первокурсник Женя случайно попадает в испытательный образец новой модели робота «Апостол» (A.P.O100L), обладающего собственной волей и разумом. Получив случайного пилота, машина берет управление на себя и принимает решение сбежать из лаборатории. Теперь, чтобы вернуться домой, Жене придется найти с искусственным интеллектом общий язык.",
      "posterServe": "http://localhost:3001/posters/intelekt.png",
      "poster": "intelekt.png"
    },
    {
      "id": 13,
      "title": "Эффект бабочки",
      "year": 2003,
      "genres": [ "фантастика", "триллер", "драма"],
      "description": "Эван перенял от своего отца-психопата, ныне запертого в доме для умалишённых, странную болезнь — он не помнит некоторых эпизодов своей жизни, причем в эти моменты происходили довольно странные, а то и ужасные события. Поступив в колледж, Эван делает удивительное открытие. Читая дневники, которые писал в детстве по совету врача, он может возвращаться в детство и менять будущее.",
      "rating": 6.6,
      "posterServe": "http://localhost:3001/posters/effect.png",
      "poster": "effect.png"
    },
    {
      "id": 14,
      "title": "Мстители: Война бесконечности",
      "year": 2018,
      "genres": ["фантастика", "боевик", "приключения"],
      "description": "Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности — артефакты невероятной силы, с помощью которых можно менять реальность. Всё, с чем Мстители сталкивались ранее, вело к этому моменту — судьба Земли никогда ещё не была столь неопределённой.",
      "rating": 8.6,
      "posterServe": "http://localhost:3001/posters/avenger.png",
      "poster": "avenger.png"
    },
    {
      "id": 15,
      "title": "Три богатыря. Ни дня без подвига",
      "year": 2023,
      "genres": ["мультфильм", "приключения", "фэнтези"],
      "description": "У трех богатырей что ни день, то подвиг по расписанию. То придется расследовать похищение княжеской короны, то спасать друзей из волшебного мира снов, то Конь Юлий с Алешей схлестнутся в эпической битве умов. Не бывает маленьких приключений, да и богатыри наши — немаленькие.",
      "rating": 7.8,
      "posterServe": "http://localhost:3001/posters/trio.png",
      "poster": "trio.png"
    }
  ]
}
